---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.LocationPoint
source: html/e1071a1b-b98e-5875-2e13-b673e2b9fef6.htm
---
# LocationPoint Members

Causes the object to release immediately any resources it may be utilizing.